# División por columnas

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'key': ['A', 'B', 'C', 'A', 'B', 'C'],
    'value1': range(6),
    'value2': np.random.randint(0, 100, 6)
})
df

  key  value1  value2
0   A       0      86
1   B       1      21
2   C       2      46
3   A       3      18
4   B       4      68
5   C       5      65

In [3]:
L = [0, 1, 0, 1, 2, 0]  # Lista con los índices de df.

In [4]:
display(df, df.groupby(L).sum())

  key  value1  value2
0   A       0      86
1   B       1      21
2   C       2      46
3   A       3      18
4   B       4      68
5   C       5      65

   value1  value2
0       7     197
1       4      39
2       4      68

In [5]:
df.groupby('key').sum()  # Se pasa un str con el identificador de la columna.

     value1  value2
key
A         3     104
B         5      89
C         7     111

In [6]:
df.groupby(df['key']).sum()  # Se pasan los valores de la columna.

     value1  value2
key
A         3     104
B         5      89
C         7     111

In [7]:
df2 = df.set_index('key')
df2

     value1  value2
key
A         0      86
B         1      21
C         2      46
A         3      18
B         4      68
C         5      65

In [8]:
mapping = {
    'A': 'vowel',
    'B': 'consonant',
    'C': 'consonant'
}  # Mapeado diferente para cada una de las columnas

In [9]:
df2.groupby(mapping).sum()

           value1  value2
consonant      12     200
vowel           3     104

In [10]:
df2.groupby(str.lower).mean()

   value1  value2
a     1.5    52.0
b     2.5    44.5
c     3.5    55.5

In [11]:
df2.groupby([str.lower, mapping]).mean()

             value1  value2
a vowel         1.5    52.0
b consonant     2.5    44.5
c consonant     3.5    55.5